Tekla Open API Reference for Tekla Structures 2025
ShapeItemEnumerator Properties
The ShapeItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a shape item instance of the current element.
Top
See Also
Reference
ShapeItemEnumerator Class
Tekla.Structures.Catalogs Namespace